#+TITLE: Emacs Config
#+AUTHOR: Patrick Skiba
#+EMAIL: pskiba@posteo.net
#+OPTIONS: toc:nil num:nil

* Basics
- Backups
   Backup all files in a backup directory rather than in the current directory
   #+begin_src emacs-lisp
   (setq backup-directory-alist '(("." . "~/.config/emacs/backup")))
   #+end_src

   #+RESULTS:
   : ((. . ~/.emacs.d/backup))

- Clock
   Enable system clock in the bottom row
   #+begin_src emacs-lisp
   (display-time-mode t)
   #+end_src

   #+RESULTS:
   : t

- Recursive Minibuffer
   Allow interactive commands from within the minibuffer. For an in depth explaination of what it does see the following [[post][https://www.masteringemacs.org/article/executing-shell-commands-emacs]]
   #+begin_src emacs-lisp
   (setq enable-recursive-minibuffers t)
   #+end_src

   #+RESULTS:
   : t

- Add parts of each file's directory to the buffer name if not unique
   #+begin_src emacs-lisp
   (require 'uniquify)
   (setq uniquify-buffer-name-style 'forward)
   #+end_src

   #+RESULTS:
   : forward

- 80 chars is a good width.
   #+begin_src emacs-lisp
   (set-default 'fill-column 80)
   #+end_src

   #+RESULTS:
   : 80

- Hide UI cruft
   #+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
   #+end_src

   #+RESULTS:

- Hide the splash screen
   #+begin_src emacs-lisp
(setq inhibit-startup-message t
inhibit-startup-echo-area-message t)
   #+end_src

   #+RESULTS:
   : t

- Emacs auto indent
   #+begin_src emacs-lisp
(define-key global-map (kbd "RET") 'newline-and-indent)
   #+end_src

   #+RESULTS:
   : newline-and-indent
- Move files to trash when deleting
   #+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
   #+end_src

   #+RESULTS:
   : t
- Allow pasting selection outside of Emacs
   #+begin_src emacs-lisp
(setq select-enable-clipboard t)
   #+end_src

   #+RESULTS:
   : t

- Auto refresh buffers
   #+begin_src emacs-lisp
(global-auto-revert-mode 1)
   #+end_src

   #+RESULTS:
   : t

- Also auto refresh dired, but be quiet about it
   #+begin_src emacs-lisp
(defvar global-auto-revert-non-file-buffers)
(setq global-auto-revert-non-file-buffers t)

(defvar auto-revert-verbose)
(setq auto-revert-verbose nil)
   #+end_src

   #+RESULTS:

- Show keystrokes in progress
   #+begin_src emacs-lisp
(setq echo-keystrokes 0.1)
   #+end_src

   #+RESULTS:
   : 0.1

- Real emacs knights don't use shift to mark things
   #+begin_src emacs-lisp
(setq shift-select-mode nil)
   #+end_src

   #+RESULTS:

- Transparently open compressed files
   #+begin_src emacs-lisp
(auto-compression-mode t)
   #+end_src

   #+RESULTS:
   : t

- Enable syntax highlighting for older Emacsen that have it off
   #+begin_src emacs-lisp
(global-font-lock-mode t)
   #+end_src

   #+RESULTS:
   : t

- Answering just 'y' or 'n' will do
   #+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
   #+end_src

   #+RESULTS:
   : yes-or-no-p

- UTF-8 please
   #+begin_src emacs-lisp
(setq locale-coding-system 'utf-8) ; pretty
(set-terminal-coding-system 'utf-8) ; pretty
(set-keyboard-coding-system 'utf-8) ; pretty
(set-selection-coding-system 'utf-8) ; please
(prefer-coding-system 'utf-8) ; with sugar on top
   #+end_src

   #+RESULTS:

- Show active region
    #+begin_src emacs-lisp
(transient-mark-mode 1)
(make-variable-buffer-local 'transient-mark-mode)
(put 'transient-mark-mode 'permanent-local t)
(setq-default transient-mark-mode t)
   #+end_src

   #+RESULTS:
   : t

- Don't highlight matches with jump-char - it's distracting
   #+begin_src emacs-lisp
(defvar jump-char-lazy-highlight-face)
(setq jump-char-lazy-highlight-face nil)
   #+end_src

   #+RESULTS:

- Save a list of recent files visited. (open recent file with C-x f)
   #+begin_src emacs-lisp
(recentf-mode 1)
(defvar recentf-max-saved-items)
(setq recentf-max-saved-items 100) ;; just 20 is too recent
   #+end_src

   #+RESULTS:
   : 100

- Save minibuffer history
   #+begin_src emacs-lisp
(savehist-mode 1)
(setq history-length 1000)
   #+end_src

   #+RESULTS:
   : 1000

- Undo/redo window configuration with C-c <left>/<right>
   #+begin_src emacs-lisp
(winner-mode 1)
   #+end_src

   #+RESULTS:
   : t

- Never insert tabs
   #+begin_src emacs-lisp
(set-default 'indent-tabs-mode nil)
   #+end_src

   #+RESULTS:

- Easily navigate sillycased words
   #+begin_src emacs-lisp
(global-subword-mode 1)
   #+end_src

   #+RESULTS:
   : t

- Don't break lines for me, please
   #+begin_src emacs-lisp
(setq-default truncate-lines t)
   #+end_src

   #+RESULTS:
   : t

- Allow recursive minibuffers
   #+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)
   #+end_src

   #+RESULTS:
   : t

- Don't be so stingy on the memory, we have lots now. It's the distant future.
   #+begin_src emacs-lisp
(setq gc-cons-threshold 200000000)
   #+end_src

   #+RESULTS:
   : 200000000

- org-mode: Don't ruin S-arrow to switch windows please (use M-+ and M-- instead to toggle)
   #+begin_src emacs-lisp
(defvar org-replace-disputed-keys)
(setq org-replace-disputed-keys t)
   #+end_src

   #+RESULTS:
   : t

- Fontify org-mode code blocks
   #+begin_src emacs-lisp
(defvar org-src-fontify-natively)
(setq org-src-fontify-natively t)
   #+end_src

   #+RESULTS:
   : t

- Sentences do not need double spaces to end. Period.
   #+begin_src emacs-lisp
(set-default 'sentence-end-double-space nil)
   #+end_src

   #+RESULTS:

- A saner ediff
   #+begin_src emacs-lisp
(defvar ediff-diff-options)
(setq ediff-diff-options "-w")

(defvar ediff-split-window-function)
(setq ediff-split-window-function 'split-window-horizontally)

(defvar ediff-window-setup-function)
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
   #+end_src

   #+RESULTS:
   : ediff-setup-windows-plain

- Display Window Number
   #+begin_src emacs-lisp
   (ace-window-display-mode t)
   #+end_src

   #+RESULTS:
   : t

** Doom Modeline
A nice looking modeline with icons that replaces the boring default modeline.
   #+begin_src emacs-lisp
   (use-package doom-modeline
   :ensure t
   :hook (after-init . doom-modeline-mode))

   (defun enable-doom-modeline-icons (_frame)
   (setq doom-modeline-icon t))
  
   (add-hook 'after-make-frame-functions 
   #'enable-doom-modeline-icons)

   #+end_src

   #+RESULTS:
   | enable-doom-modeline-icons | x-dnd-init-frame |

** Rainbow Delimiters
Helps find matching parens and brackets using a simple solution.
   #+begin_src emacs-lisp
   (use-package rainbow-delimiters
   :ensure t
   :hook (prog-mode . rainbow-delimiters-mode))
   #+end_src

   #+RESULTS:
   | rainbow-delimiters-mode |

** Prettier
Javascript formatter with configuration to play nice with the Standard linter.
   #+begin_src emacs-lisp
   (use-package prettier-js
   :ensure t
   :hook (js-mode . prettier-js-mode)
   :init
   (setq prettier-js-args '(
   "--trailing-comma" "none"
   "--bracket-spacing" "true"
   "--single-quote" "true"
   "--no-semi" "true"
   "--jsx-single-quote" "true"
   "--jsx-bracket-same-line" "true"
   "--print-width" "100")))
   #+end_src

   #+RESULTS:
   | prettier-js-mode | setup-tide-mode |

